#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/initialised-si/JoWe-Web-Dev/runs/run-RMfD3hoEnpqXnX7R

Waiting for the plan to start...

Terraform v1.5.3
on linux_amd64
Initializing plugins and modules...
module.web.aws_cloudfront_origin_access_identity.jowe_web: Refreshing state... [id=E2WK19VXEQOQCH]
module.web.aws_s3_bucket.jowe_web: Refreshing state... [id=jowe-dev.initialised.si]
module.web.aws_s3_bucket_versioning.jowe_web: Refreshing state... [id=jowe-dev.initialised.si]
module.web.aws_s3_bucket_ownership_controls.jowe_web: Refreshing state... [id=jowe-dev.initialised.si]
module.web.aws_s3_bucket_public_access_block.jowe_web: Refreshing state... [id=jowe-dev.initialised.si]
module.web.data.aws_iam_policy_document.jowe_web_s3_policy: Refreshing...
module.web.data.aws_iam_policy_document.jowe_web_s3_policy: Refresh complete after 0s [id=3228599042]
module.web.aws_s3_bucket_policy.jowe_web: Refreshing state... [id=jowe-dev.initialised.si]
module.web.aws_cloudfront_distribution.jowe_web: Refreshing state... [id=E36U11KHAWUB2P]
module.web.aws_s3_bucket_acl.jowe_web: Refreshing state... [id=jowe-dev.initialised.si,private]
module.web.aws_s3_object.upload_webapp["static/media/anonymous-male.a323776dc6f4f8a3ceb8.jpg"]: Refreshing state... [id=static/media/anonymous-male.a323776dc6f4f8a3ceb8.jpg]
module.web.aws_s3_object.upload_webapp["index.html"]: Refreshing state... [id=index.html]
module.web.aws_s3_object.upload_webapp["static/js/698.1c688865.chunk.js"]: Refreshing state... [id=static/js/698.1c688865.chunk.js]
module.web.aws_s3_object.upload_webapp["static/js/726.51f7dd57.chunk.js"]: Refreshing state... [id=static/js/726.51f7dd57.chunk.js]
module.web.aws_s3_object.upload_webapp["manifest.json"]: Refreshing state... [id=manifest.json]
module.web.aws_s3_object.upload_webapp["static/css/612.11e8f03c.chunk.css.map"]: Refreshing state... [id=static/css/612.11e8f03c.chunk.css.map]
module.web.aws_s3_object.upload_webapp["static/js/106.8390d3bf.chunk.js"]: Refreshing state... [id=static/js/106.8390d3bf.chunk.js]
module.web.aws_s3_object.upload_webapp["static/css/106.872b5878.chunk.css.map"]: Refreshing state... [id=static/css/106.872b5878.chunk.css.map]
module.web.aws_s3_object.upload_webapp["asset-manifest.json"]: Refreshing state... [id=asset-manifest.json]
module.web.aws_s3_object.upload_webapp["static/js/924.16f99540.chunk.js.map"]: Refreshing state... [id=static/js/924.16f99540.chunk.js.map]
module.web.aws_s3_object.upload_webapp["static/css/106.872b5878.chunk.css"]: Refreshing state... [id=static/css/106.872b5878.chunk.css]
module.web.aws_s3_object.upload_webapp["favicon.ico"]: Refreshing state... [id=favicon.ico]
module.web.aws_s3_object.upload_webapp["static/js/106.8390d3bf.chunk.js.map"]: Refreshing state... [id=static/js/106.8390d3bf.chunk.js.map]
module.web.aws_s3_object.upload_webapp["static/js/main.617580f6.js.map"]: Refreshing state... [id=static/js/main.617580f6.js.map]
module.web.aws_s3_object.upload_webapp["static/js/main.617580f6.js"]: Refreshing state... [id=static/js/main.617580f6.js]
module.web.aws_s3_object.upload_webapp["static/js/616.be09603d.chunk.js.map"]: Refreshing state... [id=static/js/616.be09603d.chunk.js.map]
module.web.aws_s3_object.upload_webapp["static/css/main.61b89840.css.map"]: Refreshing state... [id=static/css/main.61b89840.css.map]
module.web.aws_s3_object.upload_webapp["static/js/726.51f7dd57.chunk.js.map"]: Refreshing state... [id=static/js/726.51f7dd57.chunk.js.map]
module.web.aws_s3_object.upload_webapp["static/js/612.e454137c.chunk.js"]: Refreshing state... [id=static/js/612.e454137c.chunk.js]
module.web.aws_s3_object.upload_webapp["static/css/main.61b89840.css"]: Refreshing state... [id=static/css/main.61b89840.css]
module.web.aws_s3_object.upload_webapp["static/css/612.11e8f03c.chunk.css"]: Refreshing state... [id=static/css/612.11e8f03c.chunk.css]
module.web.aws_s3_object.upload_webapp["static/css/777.872b5878.chunk.css"]: Refreshing state... [id=static/css/777.872b5878.chunk.css]
module.web.aws_s3_object.upload_webapp["static/js/616.be09603d.chunk.js.LICENSE.txt"]: Refreshing state... [id=static/js/616.be09603d.chunk.js.LICENSE.txt]
module.web.aws_s3_object.upload_webapp["static/js/924.16f99540.chunk.js"]: Refreshing state... [id=static/js/924.16f99540.chunk.js]
module.web.aws_s3_object.upload_webapp["static/js/777.107dea8d.chunk.js"]: Refreshing state... [id=static/js/777.107dea8d.chunk.js]
module.web.aws_s3_object.upload_webapp["static/css/777.872b5878.chunk.css.map"]: Refreshing state... [id=static/css/777.872b5878.chunk.css.map]
module.web.aws_s3_object.upload_webapp["static/js/777.107dea8d.chunk.js.map"]: Refreshing state... [id=static/js/777.107dea8d.chunk.js.map]
module.web.aws_s3_object.upload_webapp["static/media/anonymous-female.9d832d02f50e90f40bbe.jpg"]: Refreshing state... [id=static/media/anonymous-female.9d832d02f50e90f40bbe.jpg]
module.web.aws_s3_object.upload_webapp["static/js/698.1c688865.chunk.js.map"]: Refreshing state... [id=static/js/698.1c688865.chunk.js.map]
module.web.aws_s3_object.upload_webapp["static/js/612.e454137c.chunk.js.map"]: Refreshing state... [id=static/js/612.e454137c.chunk.js.map]
module.web.aws_s3_object.upload_webapp["static/js/616.be09603d.chunk.js"]: Refreshing state... [id=static/js/616.be09603d.chunk.js]
module.web.aws_s3_object.upload_webapp["static/js/main.617580f6.js.LICENSE.txt"]: Refreshing state... [id=static/js/main.617580f6.js.LICENSE.txt]
module.web.aws_s3_object.upload_webapp["static/js/496.71d68e66.chunk.js"]: Refreshing state... [id=static/js/496.71d68e66.chunk.js]
module.web.aws_s3_object.upload_webapp["static/js/496.71d68e66.chunk.js.map"]: Refreshing state... [id=static/js/496.71d68e66.chunk.js.map]
module.web.aws_s3_object.upload_webapp["static/js/main.617580f6.js"]: Drift detected (update)
module.web.aws_s3_object.upload_webapp["static/js/496.71d68e66.chunk.js.map"]: Drift detected (update)
module.web.aws_s3_object.upload_webapp["static/js/main.617580f6.js.map"]: Drift detected (update)
module.web.aws_s3_object.upload_webapp["static/js/main.617580f6.js.LICENSE.txt"]: Drift detected (update)
module.web.aws_s3_object.upload_webapp["static/js/496.71d68e66.chunk.js"]: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.web.aws_s3_object.upload_webapp["asset-manifest.json"] will be updated in-place
  ~ resource "aws_s3_object" "upload_webapp" {
      ~ etag                   = "63e8407d56b316338695041c23b5df01" -> "81721a9d557601498f0805c8f2ca8ccf"
        id                     = "asset-manifest.json"
        tags                   = {}
      ~ version_id             = "PNqPTylatnNAi.3FtDox_N98sbZ.8i3F" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.web.aws_s3_object.upload_webapp["index.html"] will be updated in-place
  ~ resource "aws_s3_object" "upload_webapp" {
      ~ etag                   = "fe5fdd13d2932b6353435ed5c4e45f57" -> "b703bb738c20fa682be0e7a86ff0da59"
        id                     = "index.html"
        tags                   = {}
      ~ version_id             = "XPcixEj3Y066hLGBVrKD0JvWQ1d_NGla" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/main.37c666a3.js"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + acl                    = (known after apply)
      + bucket                 = "jowe-dev.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/javascript"
      + etag                   = "8de951ff2e26e716a1c161f25bc8b176"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/main.37c666a3.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/main.37c666a3.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/main.37c666a3.js.LICENSE.txt"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + acl                    = (known after apply)
      + bucket                 = "jowe-dev.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/plain; charset=utf-8"
      + etag                   = "7d654f4b13eb47973abdbf94b0b3eee2"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/main.37c666a3.js.LICENSE.txt"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/main.37c666a3.js.LICENSE.txt"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/main.37c666a3.js.map"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + acl                    = (known after apply)
      + bucket                 = "jowe-dev.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "2ee8cadeb2b3693cad427a92bd5d00db"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/main.37c666a3.js.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/main.37c666a3.js.map"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/main.617580f6.js"] will be destroyed
  # (because key ["static/js/main.617580f6.js"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - bucket                 = "jowe-dev.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "1d581684a868fae35b3b0ffa954705dd" -> null
      - force_destroy          = false -> null
      - id                     = "static/js/main.617580f6.js" -> null
      - key                    = "static/js/main.617580f6.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/js/main.617580f6.js" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "kro1N4WMVMB9Q7v3MlPqcTVuNGg70FVr" -> null
    }

  # module.web.aws_s3_object.upload_webapp["static/js/main.617580f6.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/main.617580f6.js.LICENSE.txt"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - bucket                 = "jowe-dev.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "text/plain; charset=utf-8" -> null
      - etag                   = "7d654f4b13eb47973abdbf94b0b3eee2" -> null
      - force_destroy          = false -> null
      - id                     = "static/js/main.617580f6.js.LICENSE.txt" -> null
      - key                    = "static/js/main.617580f6.js.LICENSE.txt" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/js/main.617580f6.js.LICENSE.txt" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "s.WA5V_TfCHlM9rEU78f4A_UyMXXcAmk" -> null
    }

  # module.web.aws_s3_object.upload_webapp["static/js/main.617580f6.js.map"] will be destroyed
  # (because key ["static/js/main.617580f6.js.map"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - bucket                 = "jowe-dev.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/octet-stream" -> null
      - etag                   = "f00a9f55d5d4f7e044bf683cbf6b51a8" -> null
      - force_destroy          = false -> null
      - id                     = "static/js/main.617580f6.js.map" -> null
      - key                    = "static/js/main.617580f6.js.map" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/js/main.617580f6.js.map" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "7V15GQUq9btDKlHXE3JDLnphyz5cxqdG" -> null
    }

Plan: 3 to add, 2 to change, 3 to destroy.

------------------------------------------------------------------------

Cost Estimation:

Resources: 0 of 37 estimated
           $0.0/mo +$0.0

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @dependabot[bot], Action: `pull_request`*